Repository: dipievil/easy-ssh-mob
Catalog: src/lib/l10n/app_*.arb
Languages: pt

source: Settings
pt: Configurações

source: Notifications
pt: Notificações

# notificationsSubtitle
source: Configure alerts and sounds
pt: Configurar alertas e sons

source: Session Log
pt: Log da Sessão

# sessionLogSubtitle
source: View command history
pt: Ver histórico de comandos

source: About App
pt: Sobre o App

# aboutAppSubtitle
source: Version information
pt: Informações da versão

source: Clear Credentials
pt: Limpar Credenciais

# clearCredentialsSubtitle
source: Forget saved login data
pt: Esquecer dados de login salvos

source: Current Connection
pt: Conexão Atual

source: Port
pt: Porta

source: User
pt: Usuário

source: Connected
pt: Conectado

source: Disconnected
pt: Desconectado

source: Notification Settings
pt: Configurações de Notificação

source: Notification Types
pt: Tipos de Notificação

# infoDescription
source: General information
pt: Informações gerais

source: Success
pt: Sucesso

# successDescription
source: Successful operations
pt: Operações bem-sucedidas

source: Warning
pt: Aviso

# warningDescription
source: Situations requiring attention
pt: Situações que requerem atenção

source: Error
pt: Erro

# errorDescription
source: Problems during operations
pt: Problemas durante operações

source: Critical
pt: Crítico

# criticalDescription
source: Serious system failures
pt: Falhas graves do sistema

source: Close
pt: Fechar

# testMessageInfo
source: This is an informative notification
pt: Esta é uma notificação informativa

# testMessageSuccess
source: Operation completed successfully!
pt: Operação realizada com sucesso!

# testMessageWarning
source: Warning: this is an alert
pt: Atenção: isto é um aviso

# testMessageError
source: An error occurred during operation
pt: Ocorreu um erro na operação

# testMessageCritical
source: CRITICAL: Serious system failure
pt: CRÍTICO: Falha grave do sistema

source: Notification Test
pt: Teste de Notificação

# notificationTestSubtitle
source: Test improved notification system
pt: Testar sistema de notificação melhorado

source: Not connected to SSH server
pt: Não conectado ao servidor SSH

# permissionDeniedDirectory
source: Permission denied. You do not have access to this directory.
pt: Permissão negada. Você não tem acesso a este diretório.

# directoryNotFound
source: Directory not found or does not exist.
pt: Diretório não encontrado ou não existe.

# notADirectory
source: The specified path is not a directory.
pt: O caminho especificado não é um diretório.

# directoryTimeout
source: Directory listing timeout. The server may be slow or unresponsive.
pt: Timeout na listagem do diretório. O servidor pode estar lento ou sem resposta.

# errorAccessingDirectory
source: Error accessing directory: {error}
pt: Erro ao acessar diretório: {error}

# connectionRefused
source: Connection refused. Check if SSH service is running on the server.
pt: Conexão recusada. Verifique se o serviço SSH está rodando no servidor.

# hostUnreachable
source: Host unreachable. Check the server address and network connection.
pt: Host inacessível. Verifique o endereço do servidor e conexão de rede.

# authenticationFailed
source: Authentication failed. Check your username and password.
pt: Falha na autenticação. Verifique seu usuário e senha.

# connectionTimeout
source: Connection timeout. The server may be down or unreachable.
pt: Timeout de conexão. O servidor pode estar fora do ar ou inacessível.

# keyExchangeFailed
source: Key exchange failed. The server may not support this client.
pt: Falha na troca de chaves. O servidor pode não suportar este cliente.

# hostKeyVerificationFailed
source: Host key verification failed. The server identity could not be verified.
pt: Falha na verificação da chave do host. A identidade do servidor não pôde ser verificada.

source: Automatic reconnection failed
pt: Falha na reconexão automática

# automaticReconnectionFailedAttempts
source: Automatic reconnection failed after {attempts} attempts.
pt: Falha na reconexão automática após {attempts} tentativas.

source: Connection lost
pt: Conexão perdida

# reconnectQuestion
source: Do you want to try reconnecting?
pt: Deseja tentar reconectar?

source: Reconnect
pt: Reconectar

source: Go to Login
pt: Ir para Login

source: Error listing directory
pt: Erro ao listar diretório

source: Check permissions and connection
pt: Verifique as permissões e conexão

# directoryNotAccessible
source: Directory does not exist or is not accessible: {path}
pt: Diretório não existe ou não é acessível: {path}

# commandTimeout
source: Command took too long to execute
pt: Comando demorou muito tempo para executar

# commandTimeoutSuggestion
source: Try using a longer timeout or simplifying the command
pt: Tente usar um timeout maior ou simplificar o comando

source: SSH connection error
pt: Erro de conexão SSH

source: Command execution error
pt: Erro de execução de comando

source: Reconnected successfully
pt: Reconectado com sucesso

source: SSH Reconnected
pt: SSH Reconectado

# connectionLostTouch
source: Connection lost. Touch to see options.
pt: Conexão perdida. Toque para ver opções.

source: SSH Connection Lost
pt: Conexão SSH Perdida

# automaticReconnectionFailedDetails
source: Automatic reconnection failed after {attempts} attempts.
pt: Falha na reconexão automática após {attempts} tentativas.

# errorSsh
source: SSH Error
pt: Erro SSH

# executionError
source: Execution error: {error}
pt: Erro de execução: {error}

# fileNotTextFile
source: File is not a text file
pt: Arquivo não é um arquivo de texto

# errorReadingFile
source: Error reading file: {error}
pt: Erro ao ler arquivo: {error}

# invalidModePartialRead
source: Invalid mode for partial read: {mode}
pt: Modo inválido para leitura parcial: {mode}

# readModeNotSupported
source: Read mode not supported: {mode}
pt: Modo de leitura não suportado: {mode}

# errorReadingFileWithMode
source: Error reading file with mode {mode}: {error}
pt: Erro ao ler arquivo com modo {mode}: {error}

# connectionErrorGeneric
source: Connection error: {error}
pt: Erro de conexão: {error}

# networkError
source: Network error. Check your internet connection.
pt: Erro de rede. Verifique sua conexão com a internet.

source: Disconnect from server
pt: Desconectar do servidor

# appDescription
source: Simple and intuitive SSH client for mobile devices.
pt: Cliente SSH simples e intuitivo para dispositivos móveis.

# sshSimpleClient
source: Simple and intuitive SSH client for mobile devices.
pt: Cliente SSH simples e intuitivo para dispositivos móveis.

# developedWithFlutter
source: Developed with Flutter ðŸ’™
pt: Desenvolvido com Flutter 💙

# packageLabel
source: Package
pt: Pacote

# clearCredentialsDialogTitle
source: Clear Credentials
pt: Limpar Credenciais

# clearCredentialsDialogContent
source: Are you sure you want to forget all saved credentials? You will need to enter login data again.
pt: Tem certeza de que deseja esquecer todas as credenciais salvas? Você precisará inserir os dados de login novamente.

# clearCredentialsTitle
source: Clear Credentials
pt: Limpar Credenciais

# clearCredentialsContent
source: Are you sure you want to forget all saved credentials? You will need to enter login data again.
pt: Tem certeza de que deseja esquecer todas as credenciais salvas? Você precisará inserir os dados de login novamente.

source: Cancel
pt: Cancelar

source: Clear
pt: Limpar

# credentialsRemovedSuccess
source: Credentials removed successfully
pt: Credenciais removidas com sucesso

# logoutDialogContent
source: Do you want to disconnect from the SSH server? You will return to the login screen.
pt: Deseja desconectar do servidor SSH? Você retornará à tela de login.

# logoutContent
source: Do you want to disconnect from SSH server? You will return to the login screen.
pt: Deseja desconectar do servidor SSH? Você retornará à tela de login.
